[
{"course_Title": "Topics in Quantitative Risk Management", "course_subject": "Actuarial Science (ACTSC)", "course_catalog": "964", "unit_weight": "0.50", "course_component": "LEC", "grading_basis": "NUM", "description": "Fundamental concepts in quantitative risk management. Topics typically include: risk measures, extreme value theory, multivariate distributions and copulas. This course has a focus on mathematical and statistical techniques. Other topics may be covered at the discretion of the instructor.", "course_ID": "011275"},
{"course_Title": "Finance 1", "course_subject": "Actuarial Science (ACTSC)", "course_catalog": "970", "unit_weight": "0.50", "course_component": "LEC", "grading_basis": "NUM", "description": "The course introduces options and other derivative securities in different asset classes. The main focus is on methods of pricing in a multi-period setting, but continuous-time models are also discussed. Topics may include no-arbitrage pricing theory, the fundamental theory of asset pricing, complete and incomplete markets,and pricing of complex financial instruments.", "course_ID": "000044"},
{"course_Title": "Insurance Risk Models", "course_subject": "Actuarial Science (ACTSC)", "course_catalog": "962", "unit_weight": "0.50", "course_component": "LEC", "grading_basis": "NUM", "description": "This course presents advanced mathematical and computational tools useful to study loss frequency and severity models, and also aggregate claims models.  Analytic and recursive evaluation of compound distributions are discussed, as well as generalized linear models for frequency and severity models.  Other topics covered include pricing and insurance risk processes.", "course_ID": "015701"},
{"course_Title": "Communications in Actuarial Science", "course_subject": "Actuarial Science (ACTSC)", "course_catalog": "895", "unit_weight": "0.50", "course_component": "LEC", "grading_basis": "NUM", "description": "This course is designed to develop students' oral and written communication skills, using examples from actuarial risk management.  It includes elements of writing, and also reading and summarizing leading edge work in actuarial theory and practice.  Presentations and collaborative work are used to develop essential communication skills in both academic and professional contexts.", "course_ID": "015699"},
{"course_Title": "Life Contingencies 3", "course_subject": "Actuarial Science (ACTSC)", "course_catalog": "855", "unit_weight": "0.50", "course_component": "LEC", "grading_basis": "NUM", "description": "Profit testing for traditional and non-traditional life insurance. Pricing and valuation of embedded options in life insurance products. Defined benefit and defined contribution pension plan design. Theory and practice of unit credit methods for pension plan funding and valuation for final average salary, career average earnings, and career average revalued earnings pension plans; post-retirement health benefits.", "course_ID": "000078"},
{"course_Title": "Financial Econometrics", "course_subject": "Statistics (STAT)", "course_catalog": "974", "unit_weight": "0.50", "course_component": "LEC", "grading_basis": "NUM", "description": "The focus of this course is on the statistical modelling, estimation and inference and forecasting of nonlinear financial time series, with a special emphasis on volatility and correlation of asset prices and returns.  Topics to be covered normally include: review on distribution and dynamic behaviour of financial time series, univariate and multivariate GARCH processes, long-memory time-series processes, stochastic volatility models, modelling of extreme values, copulas, realized volatility and correlation modelling for ultra high frequency data and continuous time models.", "course_ID": "014063"},
{"course_Title": "Computer Intensive Methods for Stochastic Models in Finance", "course_subject": "Statistics (STAT)", "course_catalog": "906", "unit_weight": "0.50", "course_component": "LEC", "grading_basis": "NUM", "description": "Review of basic numerical methods. Simulation of random variables, stochastic processes and stochastic models in finance. Numerical solution of deterministic and stochastic differential equations. Valuation of complex financial instruments and derivative securities. Project and paper.", "course_ID": "003104"},
{"course_Title": "Theory of Probability 2", "course_subject": "Statistics (STAT)", "course_catalog": "902", "unit_weight": "0.50", "course_component": "LEC", "grading_basis": "NUM", "description": "Review of conditioning on sigma-fields; martingale theory (discrete and continuous-time) and applications; counting processes; Brownian motion; stochastic differential and integral equations and applications; general theory of Markov processes (including martingale problems and semigroup theory), diffusions; weak convergence of stochastic processes on function spaces; functional versions of the central limit theorem and strong laws; convergence of empirical processes.", "course_ID": "003102"},
{"course_Title": "Foundations in Resource and Environmental Management", "course_subject": "Geography (GEOG)", "course_catalog": "660", "unit_weight": "0.50", "course_component": "SEM", "grading_basis": "NUM", "description": "Current research and practice in resource and environmental management. *eligible for MES.", "course_ID": "001210"},
{"course_Title": "Foundations in Environmental Science", "course_subject": "Geography (GEOG)", "course_catalog": "640", "unit_weight": "0.50", "course_component": "SEM", "grading_basis": "NUM", "description": "This seminar course examines basic concepts related to temporal and spatial scales together with\nvariability as they directly affect data collection and analysis. Leading-edge research related to\nEnvironmental Science will be critically discussed. *eligible for MES", "course_ID": "001375"},
{"course_Title": "Foundations in Human Geography", "course_subject": "Geography (GEOG)", "course_catalog": "620", "unit_weight": "0.50", "course_component": "SEM", "grading_basis": "NUM", "description": "This seminar class will provide a foundational analysis of the interdisciplinary scope of Human\nGeography by evaluating key concepts and theoretical approaches that have defined the evolution of\nthe sub-discipline in the contemporary period. Students will assess how their research interests will\ncontribute to ongoing conceptual developments in Human Geography.", "course_ID": "001364"},
{"course_Title": "Foundations in Spatial Data Handling", "course_subject": "Geography (GEOG)", "course_catalog": "600", "unit_weight": "0.50", "course_component": "SEM", "grading_basis": "NUM", "description": "This seminar class will provide a foundational analysis and overview of concepts and methodologies in\nseveral aspects of spatial data handling: cartography, geographic information systems, remote sensing,\nspatial statistics, including analysis of spatial data sets. *eligible for MES", "course_ID": "001344"},
{"course_Title": "Sustainability Applications", "course_subject": "Enviro, Resources & Sust (ERS)", "course_catalog": "681", "unit_weight": "0.50", "course_component": "LEC,RDG,SEM", "grading_basis": "NUM", "description": "The course examines how societies can respond in practical ways to complexity, change and uncertainty, Social and ecological theory is blended with examples of applications and strategies (local/global) to support management and governance in social-ecological systems.  Emphasis is placed on how individuals and societies can transcend disciplinary thinking to build our capacity to foster sustainability.", "course_ID": "014364"},
{"course_Title": "Sustainability Foundations", "course_subject": "Enviro, Resources & Sust (ERS)", "course_catalog": "680", "unit_weight": "0.50", "course_component": "LEC", "grading_basis": "NUM", "description": "This course is intended to help students establish a reasonable working base from which to explore different fields of interest related to the pursuit of sustainability in a world of complex socio-ecological systems.  The course focuses on the nature and implications of the intertwined theories, concepts and principles that are foundational to studies and applications in the transdisciplinary MES program.", "course_ID": "011631"},
{"course_Title": "Research and Design Methods", "course_subject": "Enviro, Resources & Sust (ERS)", "course_catalog": "669", "unit_weight": "0.50", "course_component": "LEC", "grading_basis": "NUM", "description": "This course will examine different ways of knowing and modes of research design relevant for interdisciplinary environmental research.  Students will also be introduced to an array of quantitative and qualitative research methods in the natural and social sciences and will explore methods relevant to their research through class discussions and assignments.", "course_ID": "001213"},
{"course_Title": "Interdisciplinary Aeronautics Project", "course_subject": "Aviation (AVIA)", "course_catalog": "602", "unit_weight": "0.50", "course_component": "RDG,SEM", "grading_basis": "NUM", "description": "This course builds upon AVIA 601, assigning multidisciplinary student groups contemporary challenges in the air transport sector. Student groups will have the opportunity to explore their issues through field trips, industry mentors, and support from interdisciplinary faculty members. The culmination of the group project will be a written report and presentation summarizing their investigation into the aeronautical issue.", "course_ID": "016521"},
{"course_Title": "Theory of Probability 1", "course_subject": "Statistics (STAT)", "course_catalog": "901", "unit_weight": "0.50", "course_component": "LEC", "grading_basis": "NUM", "description": "Probability measures, random variables as measurable functions, expectation, independence, characteristic functions, limit theorems, applications.", "course_ID": "003101"},
{"course_Title": "Interdisciplinary Aeronautics", "course_subject": "Aviation (AVIA)", "course_catalog": "601", "unit_weight": "0.50", "course_component": "LEC,RDG", "grading_basis": "NUM", "description": "This course provides an overview of current issues and operational challenges associated with aeronautical research, aviation operations and management, policy and governance, and economics. The objective of the course is to provide a foundational knowledge base of the structure, terminology, theories, and\npractices of the air transport system. This course will facilitate an understanding of how various disciplines apply to aeronautics, facilitate interdisciplinary discussions and group work, and establish a foundation to allow learners to apply their discipline to address aeronautical issues. Interdisciplinary faculty members, industry guest speakers, and government professionals will be invited to share various perspectives on contemporary aeronautical issues.", "course_ID": "016520"},
{"course_Title": "Estimation and Hypothesis Testing", "course_subject": "Statistics (STAT)", "course_catalog": "850", "unit_weight": "0.50", "course_component": "LEC,TUT", "grading_basis": "NUM", "description": "Discussion of inference problems under the headings of hypothesis testing and point and interval estimation. Frequentist and Bayesian approaches to inference. Construction and evaluation of tests and estimators. Large sample theory of point estimation.", "course_ID": "003094"},
{"course_Title": "Financial Econometrics", "course_subject": "Actuarial Science (ACTSC)", "course_catalog": "974", "unit_weight": "0.50", "course_component": "LEC", "grading_basis": "NUM", "description": "The focus of this course is on the statistical modelling, estimation and inference and forecasting of nonlinear financial time series, with a special emphasis on volatility and correlation of asset prices and returns.  Topics to be covered normally include: review on distribution and dynamic behaviour of financial time series, univariate and multivariate GARCH processes, long-memory time-series processes, stochastic volatility models, modelling of extreme values, copulas, realized volatility and correlation modelling for ultra high frequency data and continuous time models.", "course_ID": "014063"},
{"course_Title": "Actuarial Risk Management", "course_subject": "Actuarial Science (ACTSC)", "course_catalog": "633", "unit_weight": "0.50", "course_component": "LEC,TUT", "grading_basis": "NUM", "description": "This course considers actuarial risk management in the context of practical applications in life and non-life insurance, and in pensions. Topics covered include the role of the actuary; methods for pricing and reserving in life and non-life insurance; regulatory capital; risk transfer through reinsurance or securitization; product development; model risk and governance; pension risk management; embedded options in life insurance.", "course_ID": "013401"},
{"course_Title": "Profession Communications in Actuarial Science", "course_subject": "Actuarial Science (ACTSC)", "course_catalog": "635", "unit_weight": "0.50", "course_component": "LEC,TUT", "grading_basis": "NUM", "description": "Elements of writing. Written project on an advanced topic, with a communications focus. Presentations: preparation and delivery.", "course_ID": "013403"},
{"course_Title": "Quantitative Risk Management", "course_subject": "Actuarial Science (ACTSC)", "course_catalog": "634", "unit_weight": "0.50", "course_component": "LEC,TUT", "grading_basis": "NUM", "description": "This course combines enterprise and quantitative risk management to provide a comprehensive coverage of risk management science with applications in finance, insurance and corporate governance. Topics covered include: risk taxonomy; risk measures; extreme value theory; copulas; stress and scenario testing; interest rate risk management, credit risk management; regulation, including Basel, Basel 3 and Solvency 2; risk adjusted return; capital allocation.", "course_ID": "013402"},
{"course_Title": "Data Science with Actuarial Applications", "course_subject": "Actuarial Science (ACTSC)", "course_catalog": "632", "unit_weight": "0.50", "course_component": "LEC,TUT", "grading_basis": "NUM", "description": "This course provides a comprehensive treatment of various techniques from statistics, predictive analytics and machine learning that can be used to analyze data sets relevant for actuarial applications. Specific topics covered include: modeling principles and practice, analysis and estimation of survival models, insurance pricing using generalized linear models, classification and tree-based methods.", "course_ID": "013400"},
{"course_Title": "Financial Mathematics III", "course_subject": "Actuarial Science (ACTSC)", "course_catalog": "631", "unit_weight": "0.50", "course_component": "LEC,TUT", "grading_basis": "NUM", "description": "Binomial and lattice models for option pricing. Black-Scholes option pricing. Hedging option greeks. Exotic options. Term structure models including Vasicek, Cox-Ingersoll-Ross, Hull-White, Black-Derman-Toy. Interest rate options.", "course_ID": "013399"},
{"course_Title": "Stochastic Processes for Actuarial Science", "course_subject": "Actuarial Science (ACTSC)", "course_catalog": "624", "unit_weight": "0.50", "course_component": "LEC,TUT", "grading_basis": "NUM", "description": "Counting processes; Markov processes and Kolmogorov equations; Brownian motion and geometric Brownian motion; Ito's lemma Monte Carlo simulation.", "course_ID": "013397"},
{"course_Title": "Applied Statistics", "course_subject": "Actuarial Science (ACTSC)", "course_catalog": "623", "unit_weight": "0.50", "course_component": "LEC,TUT", "grading_basis": "NUM", "description": "Generalized linear models: multiple linear regression and normal linear model; exponential family; link functions; linear predicators; estimation; testing. Time series: Univariate ARIMA; multivariate AR; ARCH and other non-linear models.", "course_ID": "013396"},
{"course_Title": "Financial Mathematics II", "course_subject": "Actuarial Science (ACTSC)", "course_catalog": "621", "unit_weight": "0.50", "course_component": "LEC,TUT", "grading_basis": "NUM", "description": "Mean-Variance portfolio theory; utility based portfolio theory; Capital-Asset Pricing Method, Arbitrage Pricing Theory, Efficient Markets Hypotheses; Capital structure and dividend policy; introduction to options with applications in corporate finance. Behavioural finance.", "course_ID": "013406"},
{"course_Title": "Casualty and Health Insurance Mathematics", "course_subject": "Actuarial Science (ACTSC)", "course_catalog": "625", "unit_weight": "0.50", "course_component": "LEC,TUT", "grading_basis": "NUM", "description": "Frequency and severity models; compound distributions, calculation of moments and probabilities using recursion; Bayesian estimation and credibility; claims reserving for non-life insurance using run-off triangle methods, introductory ruin theory.", "course_ID": "013398"},
{"course_Title": "Life Insurance Mathematics II", "course_subject": "Actuarial Science (ACTSC)", "course_catalog": "622", "unit_weight": "0.50", "course_component": "LEC,TUT", "grading_basis": "NUM", "description": "Multiple state models; premiums and reserves for stat dependent policies, including joint life and last survivor benefits; cashflow projection methods; post retirement benefits: valuation and funding. Estimation and inference for survival models. Introduction to longevity models.", "course_ID": "013395"},
{"course_Title": "Economics", "course_subject": "Actuarial Science (ACTSC)", "course_catalog": "615", "unit_weight": "0.50", "course_component": "LEC,TUT", "grading_basis": "NUM", "description": "Micro: Supply and demand; utility theory and risk aversion; production choices; competition; Macro: Fiscal and monetary policy; exchange rates; factors affecting inflation, unemployment, exchange rates and economic growth; introductory game theory; introduction to insurance economics.", "course_ID": "013393"},
{"course_Title": "Corporate Finance and Accounting", "course_subject": "Actuarial Science (ACTSC)", "course_catalog": "614", "unit_weight": "0.50", "course_component": "LEC,TUT", "grading_basis": "NUM", "description": "Principles of financial accounting; construction and analysis of accounts. Sustainability reporting. Financial planning; capital budgeting, assessment of capital projects; long term financing; short term finance and planning", "course_ID": "013392"},
{"course_Title": "Statistics for Actuarial Science", "course_subject": "Actuarial Science (ACTSC)", "course_catalog": "613", "unit_weight": "0.50", "course_component": "LEC,TUT", "grading_basis": "NUM", "description": "Discrete and continuous random variables; generating functions; dependence; maximum likelihood estimation, functions of random variables; confidence intervals, hypothesis tests; Bayesian estimation, simple linear regression.", "course_ID": "013391"},
{"course_Title": "Financial Mathematics I", "course_subject": "Actuarial Science (ACTSC)", "course_catalog": "611", "unit_weight": "0.50", "course_component": "LEC,TUT", "grading_basis": "NUM", "description": "Time value of money; simple and compound interest and discount; real returns; equations of value; loan schedules; valuation of fixed coupon bonds; valuation of real return bonds; term structure of interest rates; no arbitrage pricing; valuation of forward contracts; valuation of interest rate swaps. Duration and Immunization", "course_ID": "013389"},
{"course_Title": "Life Insurance Mathematics I", "course_subject": "Actuarial Science (ACTSC)", "course_catalog": "612", "unit_weight": "0.50", "course_component": "LEC,TUT", "grading_basis": "NUM", "description": "Models for future lifetime; insurance and annuity functions; life tables and their use; future loss random variable for a contract; calculations of premiums and reserves; standard international actuarial notation.", "course_ID": "013390"}
]